using System;

// Статичний конструктор.

// Статичні конструктори мають такі властивості:
// 1. Статичний конструктор не має модифікаторів доступу та не приймає параметрів.
// 2. Статичний конструктор викликається автоматично для ініціалізації класу перед створенням першого екземпляра
// або посиланням на якісь статичні члени. 
// 3. Статичний конструктор не можна викликати безпосередньо.
// 4. Користувач не керує тим, коли статичний конструктор виконується у програмі.
// 5. Типовим використанням статичних конструкторів є випадок, коли клас використовує файл журналу та
// Конструктор застосовується додавання записів у цей файл.

namespace Static
{
    class NotStaticClass
    {
        // Статичні поля повинні бути ініціалізовані в конструкторі.
        static readonly long readonlyField = 2;

        // Статична властивість лише для читання.
        public static long ReadonlyField
        {
            get { return NotStaticClass.readonlyField; }
        }

        // Статичний архітектор.       
        static NotStaticClass()
        {
            Console.WriteLine("Статичний конструктор");
            readonlyField = 1;
        }
    }
}
